package com.gt.algorithm.sort;

/**
 * 桶排序
 * @author GTsung
 * @date 2022/1/9
 */
public class BucketSort {

    // {21, 12, 24, 9, 98, 43, 100}
    // 按照数组中最高位数即100将其他各个数改写成3为:
    // {021, 012, 024, 009, 098, 043, 100}
    // 创建几个桶: 0桶、1桶、2桶、3桶、4桶、8桶、9桶
    // 先按照个位数放入到各自对应的桶中
    // 再从桶中依次倒出得到:
    // 100, 021, 012, 043, 024, 098, 009
    // 接着按照十位数放入到对应桶
    // 再次从桶中倒出
    // 100, 009, 012, 021, 024, 043, 098
    // 再次按照百位数放入到桶中接着倒出得到:
    // 009, 012, 021, 024, 043, 098, 100
    // 排序完成

    public static void main(String[] args) {
        
    }

}
